Catalogs/ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныДоговоров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныДоговоров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекстHTML = "";
	Вложение = Новый Структура();
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML,Вложение); 
	СтруктураФорматированногоДокумента = Справочники.ШаблоныДоговоров.ПустаяСтруктураШаблонаДоговора();
	СтруктураФорматированногоДокумента.ТекстHTML = ТекстHTML;
	СтруктураФорматированногоДокумента.Вложения = Вложение;
	
	ТекущийОбъект.ШаблонХранилище = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента, Новый СжатиеДанных(9));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
		 Элементы.ВосстановитьТиповойШаблон.Видимость = Истина;
	Иначе	
	     Элементы.ВосстановитьТиповойШаблон.Видимость = Ложь;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    СсылкаНаШаблон = Объект.Ссылка;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	    СсылкаНаШаблон = Параметры.ЗначениеКопирования;
	КонецЕсли;                                         
	
	ЦветФонаЗаменяемогоПараметра = ПечатьДоговоров.ЦветФонаЗаменяемогоПараметра();   
	
	ТекстЗагружен = Ложь;
	
	Если ЗначениеЗаполнено(СсылкаНаШаблон) Тогда
	   ДанныеШаблона = Справочники.ШаблоныДоговоров.ДанныеШаблонаДоговора(СсылкаНаШаблон);
	   Если ЗначениеЗаполнено(ДанныеШаблона.ТекстHTML) Тогда
	   		ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML,ДанныеШаблона.Вложения);
			ТекстЗагружен = Истина;
	   КонецЕсли;		
    КонецЕсли; 
   
    Если НЕ ТекстЗагружен И ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
	    // загружен изимакета
		Макет = Справочники.ШаблоныДоговоров.ПолучитьМакет(Объект.ИмяМакета);
		Вложения = Новый Структура();
		ФорматированныйДокумент.УстановитьHTML(Макет.ПолучитьТекст(),Вложения);
	КонецЕсли; 
	
	Если Не ТолькоПросмотр Тогда
	    //ДобавитьДополнительныеРеквизитыИДопСвойства();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВосстановитьТиповойШаблон(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВосстановитьТиповойШаблонЗавершение", ЭтотОбъект);

	ТекстВопроса = НСтр("ru = 'Заменить текущий шаблон договора на типовой?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьДополнительныеРеквизитыИДопСвойства()

	// Добавим дополнительные реквизиты и доп. свойства объектов для выбора в качестве параметров.
	
	СоответствиеДопРеквизитыГруппаЭлементов = Новый Соответствие;
	
	ВсеСвойства = Новый Массив;
	
	// Список доп. реквизитов и доп. сведений организации
	СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(Справочники.Организация.ПустаяСсылка(), Истина, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, СвойстваОбъекта);
	СоответствиеДопРеквизитыГруппаЭлементов.Вставить(Элементы.ГруппаДополнительныеРеквизитыОрганизация, СвойстваОбъекта);

	// Список доп. реквизитов и доп. сведений контрагента
	СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(Справочники.Контрагенты.ПустаяСсылка(), Истина, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, СвойстваОбъекта);
	СоответствиеДопРеквизитыГруппаЭлементов.Вставить(Элементы.ГруппаДополнительныеРеквизитыКонтрагент, СвойстваОбъекта);

	// Список доп. реквизитов и доп. сведений договора
	СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(Справочники.Договора.ПустаяСсылка(), Истина, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, СвойстваОбъекта);
	СоответствиеДопРеквизитыГруппаЭлементов.Вставить(Элементы.ГруппаДополнительныеРеквизитыДоговорКонтрагента, СвойстваОбъекта);

	// Список доп. сведений Счета на оплату
	//СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(Документы.СчетНаОплатуПокупателю.ПустаяСсылка(), Ложь, Истина);
	//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСвойства, СвойстваОбъекта);
	//СоответствиеДопРеквизитыГруппаЭлементов.Вставить(Элементы.ГруппаДополнительныеРеквизитыСчетНаОплатуПокупателю, СвойстваОбъекта);

	// Текстовые поля по массиву ссылок
	РеквизитыСвойств = ОбщееНазначение.ЗначенияРеквизитовОбъектов(ВсеСвойства, "Заголовок, Наименование");
	
	// Вставляем в подменю каждого объекта перечень всех его доп. реквизитов и доп. свойств отдельными пунктами.
	
	НомерКоманды = 0;
	Для Каждого КлючИЗначение Из СоответствиеДопРеквизитыГруппаЭлементов Цикл 
	
		МассивСвойств = КлючИЗначение.Значение;	
	
		Для Каждого СсылкаНаСвойство Из МассивСвойств Цикл
	
			ПоляСвойства = РеквизитыСвойств[СсылкаНаСвойство];
			Если ПоляСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		
			ИмяКоманды = "ВставитьДополнительныйРеквизит" + Формат(НомерКоманды, "ЧГ=");
			НаименованиеРеквизита = ПоляСвойства.Заголовок;
			
			Команда = Команды.Добавить(ИмяКоманды);
			Команда.Заголовок = НаименованиеРеквизита;
			Команда.Действие = "ВставитьДополнительныйРеквизит";
			
			Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), КлючИЗначение.Ключ);
			Кнопка.ИмяКоманды = ИмяКоманды;
			Кнопка.Заголовок = НаименованиеРеквизита;
			
			ЭтотОбъект.ДополнительныеРеквизиты.Добавить(ПоляСвойства.Наименование);
			
			НомерКоманды = НомерКоманды + 1;
		
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры
